# Name Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinitionCreationOptions..::..Name Property
ExternalDefinitionCreationOptions Class See Also
---
The name of the parameter definition to be created.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public string Name { get; set; }
```

Visual Basic
---
```text
Public Property Name As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ Name {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace